app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ?  ORDER BY "artists"."id" ASC LIMIT 1  [["id", 12345]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"
---
  def index
    #either all of the songs
    #or all of the songs for a particular artist
    #just redefines which list of songs to show
    if params[:artist_id]
      if Artist.exists?(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 7]]
SELECT "songs".* FROM "songs"
---
  def show
    #redirects to artists songs when artist song not found
    #if the params has an artist id, then you set the artist, you set the song
    #if there is no song, then you need to redirect_to artist_songs_path(@artist), alert: "Song not found"
    if params[:artist_id] && Artist.exists?(params[:artist_id])
        @artist = Artist.find(params[:artist_id])
        @song = @artist.songs.find_by(id: params[:id])
        if !Song.exists?(params[:id])